vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32L43x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.37" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.37/schema/PACK.xsd">
    <vendor>NSING</vendor>
    <url>https://www.nsing.com.sg/public/uploads/armpacks/</url>
    <name>N32L43x_DFP</name>
    <description>Nsing N32L43x Series Device Support, Drivers and Examples</description>

    <releases>
		<release date="2024-08-14" version="0.2.2">		    
            First release of N32L43x_DFP
        </release>
    </releases>

    <keywords>
        <keyword>NSING</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32L43x</keyword>
		<keyword>N32</keyword>
    </keywords>

    <devices>
        <family Dfamily="N32L43x Series" Dvendor="NSING:185">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
          <subFamily DsubFamily="N32L433">	  
		   <processor Dclock="108000000"/>	
           <description>
Up to 108MHz ARM Cortex-M4F, 128KB Flash, 32KB SRAM, 26xGPIO(MAX), 9xTimer, RTC, 14xPWM(MAX), 1x12bit 5Msps ADC, 1x12bit DAC, 2xOPAMP, 2xCOMP, LPRCNT, TSC, 4xU(S)ART, 1xLPUART, 2xSPI/I2S, 2xI2C, USB 2.0 FS Device, 1xCAN 2.0B, 1xDMA, Hardware Cryptographic Engine.
           </description>		   
           <compile header="firmware/CMSIS/device/n32l43x.h" define="N32L43x N32L433 USE_STDPERIPH_DRIVER"/>  
	  	   <feature type="VCC"      n="1.80"        m="5.50"/>		
		   <feature type="Temp"     n="-40"        m="105"/>	
		   <feature type="RTC"      n="1"/>		   
		  <!-- *************************  Device 'N32L433K8'  ***************************** -->
		  <device Dname="N32L433K8"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- TSC: 1x		
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="14"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32L43x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32L433.svd"/>
          </device>	
		 <!-- *************************  Device 'N32L433KB'  ***************************** -->
		  <device Dname="N32L433KB"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- TSC: 1x		
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="32" 	name="32KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="14"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32L43x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32L433.svd"/>
          </device>	
		  
		  </subFamily>
          
		  <subFamily DsubFamily="N32L436">
                <processor Dclock="108000000"/>		
                <description>
Up to 108MHz ARM Cortex-M4F, 128KB Flash, 32KB SRAM, 64xGPIO(MAX), 9xTimer, RTC, 28xPWM(MAX), 1x12bit 5Msps ADC, 1x12bit DAC, 2xOPAMP, 2xCOMP, LPRCNT, TSC, 5xU(S)ART, 1xLPUART, 2xSPI/I2S, 2xI2C, USB 2.0 FS Device, 1xCAN 2.0B, 1xDMA, LCD, Hardware Cryptographic Engine.
                </description>				
                <compile header="firmware/CMSIS/device/n32l43x.h" define="N32L43X N32L436 USE_STDPERIPH_DRIVER"/>
		 <!-- *************************  Device 'N32L436C8'  ***************************** -->
		  <device Dname="N32L436C8"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- TSC: 1x		
- LPRCNT: 1x	
- LCD: 40x20
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32L43x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32L436.svd"/>
          </device>	
		 <!-- *************************  Device 'N32L436CB'  ***************************** -->
			<device Dname="N32L436CB"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- TSC: 1x		
- LPRCNT: 1x	
- LCD: 40x20
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="32" 	name="32KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32L43x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32L436.svd"/>
          </device>	
		 <!-- *************************  Device 'N32L436R8'  ***************************** -->
			<device Dname="N32L436R8"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- TSC: 1x		
- LPRCNT: 1x	
- LCD: 4x20
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="52"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="28"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32L43x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32L436.svd"/>
          </device>	
		 <!-- *************************  Device 'N32L436RB'  ***************************** -->
			<device Dname="N32L436RB"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- TSC: 1x		
- LPRCNT: 1x	
- LCD: 4x34
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="32" 	name="32KB SRAM"/>	
			<feature type="IOs"      n="52"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="28"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32L43x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32L436.svd"/>
          </device>	
		 <!-- *************************  Device 'N32L436MB'  ***************************** -->
			<device Dname="N32L436MB"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- TSC: 1x		
- LPRCNT: 1x	
- LCD: 4x44 8x40
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="32" 	name="32KB SRAM"/>	
			<feature type="IOs"      n="64"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="28"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32L43x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32L436.svd"/>
          </device>	
		  </subFamily>
	
        </family>
    </devices> 


    <conditions>   	
		<!-- Device Conditions -->
		<condition id="N32L43x">
		  <description>NSING N32L43x Devices</description> 
		  <require Dvendor="NSING:185" Dname="N32*"/> 
		</condition>
		
		<!-- Device + CMSIS Conditions -->
        <condition id="N32L43x CMSIS">            
		    <description>NSING N32L43x Device and the ARM compiler</description>
		    <require condition="N32L43x"/>
		    <require Tcompiler="ARMCC"/>
        </condition>

