vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32L43x_DFP.pdsc
		<!-- N32L43x STDPERIPHERALS MISC Conditions -->
        <condition id="N32L43x STDPERIPHERALS">
            <description>NSING N32L43x Standard Peripherals drivers</description>
            <require condition="N32L43x CMSIS"/>
            <require Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="MISC"/>
        </condition>
		
		<!-- N32L43x STDPERIPHERALS RCC Conditions -->
        <condition id="N32L43x STDPERIPHERALS RCC">
            <description>NSING N32L43x Standard Peripherals driver with RCC</description>
            <require condition="N32L43x STDPERIPHERALS"/>
            <require Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="RCC"/>
        </condition>
		
		<condition id="N32L43x Algorithm Common" >
            <description>NSING N32L43x Series Algorithm Libraries Common Functions.</description>
            <require condition="N32L43x CMSIS"/>
            <require Cclass ="Device" Cgroup="Algorithm Libs" Csub="Common"/>
        </condition>

    </conditions>

    <components>
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="N32L43x CMSIS">
            <description>Startup File for Nsing N32L43x Series</description>
            <files>
                <file category="include" name="firmware/CMSIS/device/"/>
				<file category="header" name="firmware/CMSIS/device/n32l43x.h"/>
				<!-- startup file -->				
                <file category="source" name="firmware/CMSIS/device/startup/startup_n32l43x.s" attr="config"  version="1.0.0" condition="N32L43x CMSIS"/>
				<!-- system file -->
                <file category="source" name="firmware/CMSIS/device/system_n32l43x.c" attr="config" version="1.0.0"/>
				
            </files>
        </component>
		
	    <!-- N32L43x_StdPeripherals -->		
        <component Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="N32L43x CMSIS">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32l43x_std_periph_driver/inc/"/>
                <file category="source" name="firmware/n32l43x_std_periph_driver/src/misc.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="N32L43x STDPERIPHERALS RCC">
            <description>Analog-to-digital converter (ADC) driver for N32L43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l43x_std_periph_driver/inc/n32l43x_adc.h"/>
                <file category="source" name="firmware/n32l43x_std_periph_driver/src/n32l43x_adc.c"/>
            </files>
        </component>		
		
        <component Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="CAN" Cversion="1.0.0" condition="N32L43x STDPERIPHERALS RCC">
            <description>Controller area network (CAN) driver for N32L43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l43x_std_periph_driver/inc/n32l43x_can.h"/>
                <file category="source" name="firmware/n32l43x_std_periph_driver/src/n32l43x_can.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="COMP" Cversion="1.0.0" condition="N32L43x STDPERIPHERALS RCC">
            <description>Comparator (COMP) driver for N32L43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_COMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l43x_std_periph_driver/inc/n32l43x_comp.h"/>
                <file category="source" name="firmware/n32l43x_std_periph_driver/src/n32l43x_comp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="N32L43x STDPERIPHERALS RCC">
            <description>CRC calculation unit (CRC) driver for N32L43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l43x_std_periph_driver/inc/n32l43x_crc.h"/>
                <file category="source" name="firmware/n32l43x_std_periph_driver/src/n32l43x_crc.c"/>
            </files>
        </component>
		
       <component Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="N32L43x STDPERIPHERALS RCC">
            <description>MCU debug component (DBG) driver for N32L43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l43x_std_periph_driver/inc/n32l43x_dbg.h"/>
                <file category="source" name="firmware/n32l43x_std_periph_driver/src/n32l43x_dbg.c"/>
            </files>
        </component>
 
         <component Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="DAC" Cversion="1.0.0" condition="N32L43x STDPERIPHERALS RCC">
            <description>Digital-to-analog converter (DAC) driver for N32L43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l43x_std_periph_driver/inc/n32l43x_dac.h"/>
                <file category="source" name="firmware/n32l43x_std_periph_driver/src/n32l43x_dac.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="N32L43x STDPERIPHERALS RCC">
            <description>DMA controller (DMA) driver for N32L43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l43x_std_periph_driver/inc/n32l43x_dma.h"/>
                <file category="source" name="firmware/n32l43x_std_periph_driver/src/n32l43x_dma.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32L43x_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="N32L43x STDPERIPHERALS RCC">
            <description>External interrupt/event controller (EXTI) driver for N32L43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l43x_std_periph_driver/inc/n32l43x_exti.h"/>
                <file category="source" name="firmware/n32l43x_std_periph_driver/src/n32l43x_exti.c"/>
            </files>
        </component>
		
